T = int(input())
# 여러개의 테스트 케이스가 주어지므로, 각각을 처리합니다.

dic1 = {
    '31': (1, 31),
    '28': (1, 28),
    '30': (1, 30),
}

dic2 = {
    '31': [1, 3, 5, 7, 8, 10, 12],
    '28': [2],
    '30': [4, 6, 9, 11],
}


for test_case in range(1, T + 1):
    # ///////////////////////////////////////////////////////////////////////////////////
    s = input()
    y, m, d = s[:4], s[4:6], s[6:]

    if int(m) in dic2['31']:
        if dic1['31'][0] <= int(d) <= dic1['31'][1]:
            out = y + '/' + m + '/' + d
        else:
            out = -1
    
    elif int(m) in dic2['28']:
        if dic1['28'][0] <= int(d) <= dic1['28'][1]:
            out = y + '/' + m + '/' + d
        else:
            out = -1
    
    elif int(m) in dic2['30']:
        if dic1['30'][0] <= int(d) <= dic1['30'][1]:
            out = y + '/' + m + '/' + d
        else:
            out = -1

    else:
        out = -1

    print('#{} {}'.format(test_case, out))

    # ///////////////////////////////////////////////////////////////////////////////////